In [5]:
import pandas as pd

df = pd.read_json("./sites.json")

df

     id    name             url  likes
0  A001    菜鸟教程  www.runoob.com     61
1  A002  Google  www.google.com    124
2  A003      淘宝  www.taobao.com     45

In [6]:
data = [
    {"id": "A001", "name": "菜鸟教程", "url": "www.runoob.com", "likes": 61},
    {"id": "A002", "name": "Google", "url": "www.google.com", "likes": 124},
    {"id": "A003", "name": "淘宝", "url": "www.taobao.com", "likes": 45},
]

df2 = pd.DataFrame(data)

df2

     id    name             url  likes
0  A001    菜鸟教程  www.runoob.com     61
1  A002  Google  www.google.com    124
2  A003      淘宝  www.taobao.com     45

In [7]:
pd.read_json('./nested_list.json')

,school_name,class,students
0,ABC primary school,Year 1,"{'id': 'A001', 'name': 'Tom', 'math': 60, 'phy..."
1,ABC primary school,Year 1,"{'id': 'A002', 'name': 'James', 'math': 89, 'p..."
2,ABC primary school,Year 1,"{'id': 'A003', 'name': 'Jenny', 'math': 79, 'p..."

In [10]:
# 为了获取折叠数据，需要解析后，再转pandas的DataFrame格式

import json

with open("./nested_list.json", "r") as f:
    data = json.loads(f.read())

pd.json_normalize(data, record_path=["students"])

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

In [16]:
# 更复杂的结构

with open("./nested_mix.json", "r") as f:
    data = json.loads(f.read())

pd.json_normalize(
    data,
    record_path=["students"],
    meta=["class", ["info", "president"], ["info", "contacts", "tel"]],
)

,id,name,math,physics,chemistry,class,info.president,info.contacts.tel
0,A001,Tom,60,66,61,Year 1,John Kasich,123456789
1,A002,James,89,76,51,Year 1,John Kasich,123456789
2,A003,Jenny,79,90,78,Year 1,John Kasich,123456789

In [31]:
# 使用glom处理更深层次嵌套
from glom import glom

df3 = pd.read_json("./nested_deep.json")

df3["students"].apply(lambda row: glom(row, "grade.math"))

0    60
1    89
2    79
Name: students, dtype: int64